# Pandas

In [10]:
import pandas as pd

In [2]:
import numpy as np

In [7]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
dic = {'a':10, 'b':20,'c':30}

In [8]:
labels

['a', 'b', 'c']

In [11]:
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data= data,index= labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=data)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [16]:
series_country = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [17]:
series_country

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
series_country['USA']

np.int64(1)

# Pandas - DataFrame

In [49]:
from numpy.random import randn

In [50]:
np.random.seed(101)

In [51]:
df = pd.DataFrame(randn(5,4),['A','B','C',"D","E"],["W","X","Y","Z"])

In [52]:
""" This is going to output table with 5 rows and 4 columns , since we used randn the numbers will be positive and negative """
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [55]:
type(df['W'])

pandas.core.series.Series

In [58]:
df[['X','W']]

          X         W
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

In [60]:
df['M'] = df['W'] +df['X']

In [61]:
df

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [62]:
df.M

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
Name: M, dtype: float64

In [63]:
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [66]:
df['N'] = df.Y + df.X

In [67]:
df

          W         X         Y         Z         M         N
A  2.706850  0.628133  0.907969  0.503826  3.334983  1.536102
B  0.651118 -0.319318 -0.848077  0.605965  0.331800 -1.167395
C -2.018168  0.740122  0.528813 -0.589001 -1.278046  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177 -1.692109
E  0.190794  1.978757  2.605967  0.683509  2.169552  4.584725

In [71]:
df.drop('M', axis=1)

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [72]:
df.drop('N',axis=1)

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [73]:
df

          W         X         Y         Z         M         N
A  2.706850  0.628133  0.907969  0.503826  3.334983  1.536102
B  0.651118 -0.319318 -0.848077  0.605965  0.331800 -1.167395
C -2.018168  0.740122  0.528813 -0.589001 -1.278046  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177 -1.692109
E  0.190794  1.978757  2.605967  0.683509  2.169552  4.584725

In [74]:
df.drop('M',axis=1, inplace=True)

In [75]:
df

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [76]:
df.drop('D',axis=0)

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [77]:
df.shape

(5, 5)

In [ ]:
df.loc['A'] # This will return the information in one row not in column form in oder to return in column use df[''] in rows use df.loc[]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
N    1.536102
Name: A, dtype: float64

In [79]:
type(df.loc['B'])

pandas.core.series.Series

In [83]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
N   -1.692109
Name: D, dtype: float64

In [84]:
df.loc['B','W']

np.float64(0.6511179479432686)

In [85]:
df

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [87]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077